<?php

return [
    'admins'        => [
        'create'    => [
            'form'  => [
                'confirm_password'  => 'تاكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                "description"       => "الوصف" ,
                "location"          => "الموقع" ,
                "lat"          => "lat" ,
                "lng"          => "lng" ,
                'info'              => 'البيانات',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'كلمة المرور',
                'roles'             => 'الادوار',
            ],
            'title' => 'اضافة المدراء',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            'name'          => 'الاسم',
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'المدراء',
        ],
        'update'    => [
            'form'  => [
                'confirm_password'  => 'تآكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                'image'             => 'الصورة الشخصية',
                'mobile'            => 'الهاتف',
                "description"       => "الوصف" ,
                "location"          => "الموقع" ,
                "lat"          => "lat" ,
                "lng"          => "lng" ,
                'name'              => 'الاسم',
                'password'          => 'تغير كلمة المرور',
                'roles'             => 'الادوار',
            ],
            'title' => 'تعديل المدراء',
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
            'roles'     => [
                'required'  => 'من فضلك اختر ادوار المدير',
            ],
        ],
    ],
    'users'         => [
        'create'    => [
            'form'  => [
                'confirm_password'  => 'تاكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                'general'           => 'بيانات عامة',
                "banckAccount"      => "الحساب البنكى" ,   
                'image'             => 'الصورة الشخصية',
                'info'              => 'البيانات',
                'mobile'            => 'الهاتف',
                "description"       => "الوصف" ,
                "location"          => "الموقع" ,
                "gender"            => "النوع" ,
                "male"              => "ذكر"  ,
                "female"            => "أنثى" ,
                "lat"          => "lat" ,
                "categories"         => "الخدمات",
                "lng"          => "lng" ,
                'name'              => 'الاسم',
              
                'password'          => 'كلمة المرور',
                "money"             => "مبلغ التامين",
                "status"            => "الحاله",
                "country"           => "البلد",
                "restore"           => "استرجاع",
                "user_name"         =>  "اسم المستخدم" ,
                "bank"              => [
                    "user_name"   => "اسم صاحب الحساب",
                    "bank_name"   => "اسم البنك",
                    "account_number"=> "رقم الحساب",
                    "address"       => "العنوان",
                    "iban"          => "رقم الابيان"
                ]
            ],
            'title' => 'اضافة الاعضاء',
        ],
        'datatable' => [
            'created_at'    => 'تاريخ الآنشاء',
            'date_range'    => 'البحث بالتواريخ',
            'email'         => 'البريد الالكتروني',
            'image'         => 'الصورة الشخصية',
            'mobile'        => 'الهاتف',
            'name'          => 'الاسم',
            "money"         => "مبلغ التأمين",
            "status"        =>"الحاله",
            "verifed"       => "حالة التوثيق" ,
            "is_verifed"    => "موثق" ,
            "gender"            => "النوع" ,
            
            "not_verifed"   => "غير موثق" ,
            'options'       => 'الخيارات',
        ],
        'index'     => [
            'title' => 'الطلاب',
        ],
        'update'    => [
            'form'  => [
                'confirm_password'  => 'تآكيد كلمة المرور',
                'email'             => 'البريد الالكتروني',
                "description"       => "الوصف" ,
                "location"          => "الموقع" ,
                "lat"          => "lat" ,
                "lng"          => "lng" ,
                "categories"         => "الخدمات",
                'general'           => 'بيانات عامة',
                "gender"            => "النوع" ,
                "male"              => "ذكر"  ,
                "female"            => "أنثى" ,
                'image'             => 'الصورة الشخصية',
                'mobile'            => 'الهاتف',
                'name'              => 'الاسم',
                'password'          => 'تغير كلمة المرور',
            ],
            'title' => 'تعديل الطالب',
        ],
        'validation'=> [
            'email'     => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'    => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'      => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'  => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
        ],
    ],

  
 
];

